# Нужно создать класс который принимет данные в формате dict. Эти данные, вы сможете взять из Classroom Data #1.
#
# Вам нужно создать 6 методов класса:
#
#  1 Получить все ключи в TUPLE.
#
#  2 Получить все значения в TUPLE.
#
#  3 Получить все ключи в LIST.
#
#  4 Получить все значения в LIST.
#
#  5 Получить все ключи в SET.
#
#  6 Получить все значения в SET.
#
#
#
# Ниже когда вы будете передавать Словарь классу и вызывать из него любой метод Вы должны получать соответсвенно нужные типы данных.
#
# Example: my_class = Parser("DICT") | my_class.get_keys_tuple()