# Нужно создать класс который принимет модель ноутбука(Acer, Asus, ...) и возвращает полную комплектацию ноутбука со всеми характеристиками.
#
# В характеристики должны входить:
#
#  1 Процессор
#
#  2 Оперативная Память
#
#  3 Видео карта
#
#  4 Жёсткий Диск
#
#  5 Материнская плата
#
#  6 Размер экрана
#
# Для каждой характеристики создайте внутри класса функцию которая добавляет по одной характеристики к Dictionary.
#
# В итоге Ваш класс должен вернуть Dictionary в котором перечислены:
#
# Модель Ноутбука и его Характеристики.